src/C-C++/C++/C++-delegate.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-2.org
#+TITLE: C++ Delegate 
#+OPTIONS: num:nil H:2


* Based on Boost.Function
+ [[http://www.codeproject.com/Articles/18389/Fast-C-Delegate-Boost-Function-drop-in-replacement][Fast C++ Delegate: Boost.Function 'drop-in' replacement and
  multicast]]

* Generic
+ [[http://www.codeproject.com/Articles/7150/Member-Function-Pointers-and-the-Fastest-Possible][Member Function Pointers and the Fastest Possible C++ Delegates]]
+ [[https://molecularmusings.wordpress.com/2011/09/19/generic-type-safe-delegates-and-events-in-c/][Generic, type-safe delegates and events in C++]]
+ [[http://www.codeproject.com/Articles/11015/The-Impossibly-Fast-C-Delegates][The Impossibly Fast C++ Delegates]]
+ [[http://www.codeproject.com/Articles/6197/Emulating-C-delegates-in-Standard-C][Emulating C# delegates in Standard C++]]
+ [[https://code.google.com/p/cpp-events/][cpp-events]]
+ [[http://blog.coldflake.com/posts/C++-delegates-on-steroids/][Generic version of impossibly fast delegate using C++11 variadic
  templates.]]

* .NET
+ [[http://www.codeproject.com/Articles/26936/Understanding-NET-Delegates-and-Events-By-Practice][Understanding .NET Delegates and Events, By Practice]]



