public_html/C-C++/C++/C++-delegate.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>C++ Delegate</title>
<!-- 2015-04-12 Sun 19:52 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link href="../../assets/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../../assets/bootstrap-responsive.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">C++ Delegate</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Based on Boost.Function</a></li>
<li><a href="#sec-2">Generic</a></li>
<li><a href="#sec-3">.NET</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Based on Boost.Function</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="http://www.codeproject.com/Articles/18389/Fast-C-Delegate-Boost-Function-drop-in-replacement">Fast C++ Delegate: Boost.Function 'drop-in' replacement and
multicast</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Generic</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="http://www.codeproject.com/Articles/7150/Member-Function-Pointers-and-the-Fastest-Possible">Member Function Pointers and the Fastest Possible C++ Delegates</a>
</li>
<li><a href="https://molecularmusings.wordpress.com/2011/09/19/generic-type-safe-delegates-and-events-in-c/">Generic, type-safe delegates and events in C++</a>
</li>
<li><a href="http://www.codeproject.com/Articles/11015/The-Impossibly-Fast-C-Delegates">The Impossibly Fast C++ Delegates</a>
</li>
<li><a href="http://www.codeproject.com/Articles/6197/Emulating-C-delegates-in-Standard-C">Emulating C# delegates in Standard C++</a>
</li>
<li><a href="https://code.google.com/p/cpp-events/">cpp-events</a>
</li>
<li><a href="http://blog.coldflake.com/posts/C++-delegates-on-steroids/">Generic version of impossibly fast delegate using C++11 variadic
templates.</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">.NET</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="http://www.codeproject.com/Articles/26936/Understanding-NET-Delegates-and-Events-By-Practice">Understanding .NET Delegates and Events, By Practice</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2015-04-12 Sun 19:52</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
